Repository: andr9528/Resume
Catalog: Resume.Localization/Strings/Resources.*.resx
Languages: da

# Profile_Name
source: Andr√© Steenhoff Madsen
da: André Steenhoff Madsen

# Profile_Description
source: I am an easy-to-learn, logically thinking developer with experience in C# / .Net. During my most recent position at Tv2 Danmark, I also gained experience with TypeScript / React. As a background, I have a Computer Science degree and on top of that a Bachelor in Software Development. This education, along with my sense of logic, allows me to understand other coding languages to some degree, even if I have no previous experience with them. When I develop I strive to adhere to the DRY and SOLID principles as much as possible. With these principles in focus, I fell that code gets a good quality.
da: Jeg er en lærenem logisk tænkende udvikler, med erfaring i C# / .Net. Jeg har også under min seneste stilling ved Tv2 Danmark fået erfaring med TypeScript / React. Fra min uddannelse og stilling ved Tv2 Danmark har jeg også fået erfaring i udvikling under SCRUM. Som baggrund har jeg en Datamatiker og oven på den en Bachelor i Softwareudvikling. Denne uddannelse sammen med min logiske sans, tillader mig at forstå andre kodesprog i en vis grad, også selvom jeg ingen tidligere erfaring har med dem. Når jeg udvikler stræber jeg efter at overholde principperne DRY og SOLID, så godt som muligt. Med disse principper i fokus, føler jeg at kode får en god kvalitet.

# Project_Tracker_Title
source: Tracker Application
da: Sporings Applikation

# Project_Tracker_Description
source: A highly modular program usable to track a number of things, depending on the modules included. Will be developed using C#, Entity Framework Core and Uno Platform as frontend. Planned modules include: Dining, Budget and Time.
da: Et højt modulært program til at holde styr på en række forskellige ting, defineret af de moduler der bliver lavet. Programmet vil blive lavet med C#, Entity Framework Core og Uno Platform som frontend. Planlagte moduler inkludere madplanlægning, budget og tidsforbrug.

# Project_Tower_Defence_Dev_Title
source: Roguelike Tower Defence Game
da: Roguelike Tårn Forsvars Spil

# Project_Tower_Defence_Dev_Description
source: I have a game in mind that I would like to slowly get started on. Currently I have noted down many details of the planned game, but have not started on any code for it yet. I am heavily leaning toward using Godot as the game engine of choice, mainly for the C# language, but also due to the controversy about Unity during 2023. The game genre will be Tower Defence / Rougelike, with inspiration from a number of Mythologies, as a nod to my liking of 'Age of Mythology'.
da: Jeg har et spil i tankerne som jeg gerne vil langsomt begynde på. Har på nuværende tidspunkt en længere række noter omkring spillet, men ikke noget aktuel kode til det. Jeg har et ønske om at bruge Godot som den valgte game engine, hovedsageligt på grund af dens brug af C#, samt den kontrovers angående Unity som skete i løbet af 2023. Spillet vil være under genren Tower Defence / Rougelike, med inspiration fra en række mytologier, da jeg elsker spillet 'Age of Mythology'.

# Project_Oni_Modding_Description
source: I have some ideas for mods for one of my favorite games as of late, Oxygen Not Included, which I might spend some time on bringing to life. Some of the ideas I have shared with other modders for the game, and I will thus likely spar with them if needed. The game is developed using Unity, therefore C# is the language to be used, which is an advantage for me. It uses 'Harmony' as the access point for modders, which might help me learn it for use in my own game, if Godot allows it.
da: Jeg har nogle ideer til nogle mods til mit nuværende favorit spil, Oxygen Not Included, som jeg gerne vil bruge lidt tid på at bringe til live, hvis muligt. Nogle af disse ideer har jeg delt med andre moddere af spillet, og vil derfor muligvis kunne sparre med dem, hvis jeg har brug for det. Spillet er udviklet med Unity, derfor bliver C# brugt, som er en fordel. Modders interaction med spillet sker gennem 'Harmony', som jeg gerne vil lære om, da jeg muligvis kan bruge det til mit eget spil.

# Education_Grade_Bachelor
source: Bachelor in Software Development
da: Professionsbachelor i Software Udvikling

# Education_Grade_Software
source: Computer Science
da: Datamatiker

# Education_Grade_Htx
source: Higher Technical Exam
da: Højere Teknisk Eksamen

# Education_Description_Bachelor
source: Subjects I performed well in includes .Net Core, Database and Test.
da: Fag jeg præsterede specielt godt i inkluderer .Net Core, Database og Test.

# Education_Description_Software
source: Learned about reading and creating a number of UML diagrams, in connection with learning to develop using SCRUM.
da: Lærte at læse og skabe en længere række UML modeller i forbindelse med at blive oplært i udvikling ved brug af SCRUM.

# Education_Description_Htx
source: Was part of a small class on the Technology and Design line.
da: Var del af en lille klasse på Teknologi og Design linjen.

# Employment_Job_Title_Apps4All
source: Mobile Developer
da: Mobil Udvikler

# Employment_Job_Title_Tv2
source: Software Developer
da: Software Udvikler

# Employment_Work_Description_Apps4All
source: My primary task was to develop new mobile applications suitable to Android, for using in Point-of-Sale units. Development of the mobile applications I did through the use of Xamarin Forms. In addition to this, I also developed some Microservices to support the mobile applications. The microservices were deployed to Google Cloud.
da: Min primære arbejdsopgave var at udvikle nye mobil applikationer egnet til Android, til brug på Point-of-Sale enheder. Udviklingen af mobil applikationer gjorde jeg gennem Xamarin Forms. Dertil udviklede jeg også nogle Microservices til at understøtte mobil applikationerne. Microservicerne blev sat i funktion via Google Cloud.

# Employment_Work_Description_Tv2
source: This position ended due to a contract running out, and it not being able to be renewed, not because I was fired. I was part of a team of developers who by use of SCRUM, developed on a number of internal tools, some of which are Open Source projects. Some of the projects I have contributed to have since my contract ran out been changed to be Closed Source. I do know that this change is only temporary. On the Cliptool project, I rewrote the frontend side of the application, mainly to limit the amount of components per file to one. The rewrite was also done to apply a better file structure to the project, as it was difficult to know where different components were located beforehand. I also rewrote parts of the backend of Cliptool in the process, mainly to save changes to settings for between sessions better than before. During this rewrite, I managed to fix a number of smaller bugs, and introduce the ability to hide selected files from the GUI. On the Sofie project, I helped with creating parts of the backend, related to interacting with the underlying Mongo database and the frontend-facing presentation layer. I also helped with moving over parts of the company-specific code from the old repository, to the new structure. All in all, I went from never having touched or used TypeScript, to now feeling just as comfortable in that as I am in C#.
da: Denne stilling sluttede på grund af min kontrakt udløb, og ikke kunne blive fornyet, ikke på grund af jeg blev fyret. Jeg deltog i et team af udviklere hvor vi ved brug af SCRUM, udviklede og forbedrede på en række interne værktøjer, hvor nogle af dem er Open Source. Siden min kontrakt udløb er nogle af projekterne blevet ændret til Closed Source, men jeg har hørt at det er kun en midlertidig ændring. På Cliptool projektet, genskrev jeg frontend siden af programmet, hovedsageligt for at begrænse antallet af komponenter per fil til en. Omskrivningen betød også at en bedre fil struktur blev påført projektet, da det før var besværligt at finde komponenter man havde brug for at rette i. Under omskrivning blev backenden også rettet, hovedsageligt for at bedre gemme ændringer til indstillinger mellem sessioner, end det blev gjort før. I forbindelse med omskrivningen fik jeg også rettet en række fejl, og introduceret muligheden for at skjule valgte filer fra brugergrænsefladen. På Sofie projektet, hjalp jeg med at skabe dele af backenden relateret til interaktionen med den underliggende Mongo database, samt den frontend rettede præsentationslag. Jeg hjalp også med at flytte dele af den virksomheds specifikke kode fra det gamle repository over i den nye struktur. Alt i alt, så er jeg gået fra ikke at have rørt eller anvendt TypeScript, til nu at føle mig lige så komfortabel i det som i C#.

# General_Information_Country
source: Denmark
da: Danmark

# Language_Danish_Language
source: Danish
da: Dansk

# Language_English_Language
source: English
da: Engelsk

# Language_German_Language
source: German
da: Tysk

# Link_Remark_GitHub
source: Take a peek at my previous code.
da: Tag et kig på min tidligere kode.

# Link_Remark_LinkedIn
source: Don't mind the weird looking link, LinkedIn doesn't like my apostrophe.
da: Tag dig ikke af at linket ser lidt underligt ud, LinkedIn kan ikke lide min apostrof.

# Link_Remark_Personal_Page
source: To view this CV online.
da: Til at se dette CV online.

# References_Company_Name_Tv2
source: Tv2 Denmark
da: Tv2 Danmark

# User_Interface_Skills_Header
source: Skills
da: Evner

# Link_Title_Personal_Page
source: Personal Webpage
da: Personlig hjemmeside
